RestAssuredTests/SOAPXmls/SOAPReq.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>6</intA>
            <intB>12</intB>
        </Add>
    </Body>
</Envelope>