Data/Request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>4</intA>
            <intB>1</intB>
        </Add>
    </Body>
</Envelope>