RestAssuredAutomation/SoapRequest/add.xml.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>8</intA>
            <intB>9</intB>
        </Add>
    </Body>
</Envelope>